# Ex3 - Getting and Knowing your Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [65]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/thieu1995/csv-files/main/data/pandas/u.user).

In [91]:
user = pd.read_csv(r"https://raw.githubusercontent.com/thieu1995/csv-files/main/data/pandas/u.user",sep='|', index_col='user_id')

In [67]:
user.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [4]:
user.shape

(943, 4)

### Step 4. See the first 25 entries

In [5]:
user.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Step 5. See the last 10 entries

In [6]:
user.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. What is the number of observations in the dataset?

In [7]:
user.shape[0]

943

### Step 7. What is the number of columns in the dataset?

In [8]:
user.columns.shape

(4,)

### Step 8. Print the name of all the columns.

In [9]:
user.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 9. How is the dataset indexed?

In [10]:
print(user.iloc[:,1])
print(user.loc[1])

user_id
1      M
2      F
3      M
4      M
5      F
      ..
939    F
940    M
941    M
942    F
943    M
Name: gender, Length: 943, dtype: object
age                   24
gender                 M
occupation    technician
zip_code           85711
Name: 1, dtype: object

### Step 10. What is the data type of each column?

In [82]:
user.dtypes

age            int64
gender        object
occupation    object
zip_code      object
count          int64
dtype: object

### Step 11. Print only the occupation column

In [12]:
user['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### Step 12. How many different occupations are in this dataset?

In [13]:
a = user.value_counts('occupation').shape[0]

### Step 13. What is the most frequent occupation?

In [83]:
print(user.value_counts('occupation').index[0])

student

### Step 14. Summarize the DataFrame.

In [17]:
user.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 69.1+ KB

### Step 15. Summarize all the columns

In [93]:
user.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

### Step 16. Summarize only the occupation column

In [95]:
user['occupation'].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### Step 17. What is the mean age of users?

In [19]:
user['age'].mean()

34.05196182396607

### Step 18. What is the age with least occurrence?

In [76]:
a =user['age'].value_counts()
min = a.min()
print(a)
print(min)

30    39
25    38
22    37
28    36
27    35
      ..
7      1
66     1
11     1
10     1
73     1
Name: age, Length: 61, dtype: int64
1

In [73]:
user['count']=user.groupby('age')['age'].transform('count')
user

         age gender     occupation zip_code  count
user_id
1         24      M     technician    85711     33
2         53      F          other    94043     12
3         23      M         writer    32067     28
4         24      M     technician    43537     33
5         33      F          other    15213     26
...      ...    ...            ...      ...    ...
939       26      F        student    33319     34
940       32      M  administrator    02215     28
941       20      M        student    97229     32
942       48      F      librarian    78209     20
943       22      M        student    77841     37

[943 rows x 5 columns]

In [78]:
data = user.to_numpy()

In [81]:
print(data[:,0][np.where(data[:,4]==min)])

[7 66 11 10 73]

In [96]:
print(user.value_counts('age').index[np.where(user.value_counts('age').values==1)])

Int64Index([7, 66, 10, 11, 73], dtype='int64', name='age')